Data Duplicates and It's remedial measure

In [3]:
import pandas as pd

data = {
    'id': [1,2,2,3,4,5,6,6,7],
    'score':[10,20,20,30,40,50,60,60,60]
}
data

{'id': [1, 2, 2, 3, 4, 5, 6, 6, 7],
 'score': [10, 20, 20, 30, 40, 50, 60, 60, 60]}

In [4]:
#convert the data into dataframe
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

   id  score
0   1     10
1   2     20
2   2     20
3   3     30
4   4     40

In [6]:
#detect duplicates --> gives boolean result according to  row 
duplicates = df.duplicated()
duplicates

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [7]:
#duplicates row (give last duplication row)
df[duplicates]

   id  score
2   2     20
7   6     60

In [8]:
#duplicates row (give first duplication row)
duplicates_first = df.duplicated(keep='last')
df[duplicates_first]

   id  score
1   2     20
6   6     60

In [20]:
#find how many duplication row available in dataset
df.duplicated().sum()

2

In [21]:
duplicate_id = df.duplicated(subset='id')
duplicate_id

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [23]:
duplicate_id_values = df[duplicate_id]
duplicate_id_values

   id  score
2   2     20
7   6     60

In [19]:
duplicate_score_value = df[df.duplicated(subset=['score'])]
duplicate_score_value

   id  score
2   2     20
7   6     60
8   7     60

In [26]:
#remove duplicates
#drop_duplicates() means remove last value of duplicated row
new_df = df.drop_duplicates()
new_df

   id  score
0   1     10
1   2     20
3   3     30
4   4     40
5   5     50
6   6     60
8   7     60

In [27]:
#keep last row of duplicated row
new_df_last = df.drop_duplicates(keep='last')
new_df_last

   id  score
0   1     10
2   2     20
3   3     30
4   4     40
5   5     50
7   6     60
8   7     60

In [32]:
#delete duplicates according to column and keep last value
new_df_score = df.drop_duplicates(subset=['score'],keep='last')
new_df_last

   id  score
0   1     10
2   2     20
3   3     30
4   4     40
5   5     50
7   6     60
8   7     60